/**
 * Типові помилки
 *
 * - Звернення до змінної до її оголошення
 * - Перевизначення значення для змінної оголошеної через const
 * - Звертання по неправильному імені змінної
 *
 */

// console.log(username) //! 1 помилка: не звертайтесь до змінних або констант до моменту їх ініціалізації або створення.

const username = "Mango";

let age = 20;

// console.log(Age) //! 3 помилка: звертання до змінної, якої не існує!

const price = 200;
// price = 300; //! 2 помилка: не можна перевизначати значення константам, це заборонено!

